// тогда пойдем по...ся,
// можно без одежды
// (простите, но напрашивается)  


// Грустно действительно за этим наблюдать
// По сути - сильный грипп
//   На самом деле - безопаснее обычного гриппа: дети не болеют вообще, нестарые не очень больные люди в общем тоже, заболеваемость и смертность невысокая
// Кому то не везет, в основном людям, к-е и так в группе риска
// Каждый сезон от гриппа и пневмоний в общем и без того

function TextCell(text) {
    this.text = text.split("\n");
}

const cell = new TextCell("Hello\nwonderful\nWorld!");
console.log(cell.text[1]);
console.log(cell[1]);