const plan =
    ["############################",
        "#      #    #      o      ##",
        "#                          #",
        "#          #####           #",
        "##         #   #    ##     #",
        "###           ##     #     #",
        "#           ###      #     #",
        "#   ####                   #",
        "#   ##       o             #",
        "# o  #         o       ### #",
        "#    #                     #",
        "############################"];


        Мы используем простой тип Vector (из упражнений к предыдущей главе) для представления этих пар координат.